; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v13 ?v12)
             (pred_12 ?v3 ?v11)
             (pred_10 ?v13 ?v11)
             (pred_11 ?v9 ?v13 )
	     (pred_4 ?v13)
             (pred_5 ?v2)
             (pred_7 ?v3)
             (pred_2 ?v11)
             (pred_6 ?v13)
             (pred_1 ?v3)
             (pred_9 ?v13)
             (pred_3 ))



(:action op_2
:parameters (?v4 ?v8 ?v5 ?v6)
:precondition (and (pred_5 ?v4) (pred_5 ?v8) (pred_7 ?v5) (pred_2 ?v6)
          (pred_8 ?v4 ?v8) (pred_12 ?v5 ?v6)
                   (pred_10 ?v8 ?v6) (pred_4 ?v4) 
                   (pred_6 ?v8) (pred_1 ?v5))
:effect (and  (pred_9 ?v8) (not (pred_6 ?v8))))


(:action op_3
:parameters (?v4 ?v7)
:precondition (and (pred_5 ?v4) (pred_5 ?v7)
               (pred_4 ?v4) (pred_8 ?v4 ?v7) (pred_9 ?v7))
:effect (and (pred_4 ?v7) (not (pred_4 ?v4))))

(:action op_4
:parameters (?v4 ?v5)
:precondition (and (pred_5 ?v4) (pred_7 ?v5) 
                  (pred_4 ?v4) (pred_11 ?v5 ?v4) (pred_3 ))
:effect (and (pred_1 ?v5)
   (not (pred_11 ?v5 ?v4)) (not (pred_3 ))))


(:action op_5
:parameters (?v4 ?v10 ?v1)
:precondition (and (pred_5 ?v4) (pred_7 ?v10) (pred_7 ?v1)
                  (pred_4 ?v4) (pred_1 ?v1) (pred_11 ?v10 ?v4))
:effect (and (pred_1 ?v10) (pred_11 ?v1 ?v4)
        (not (pred_1 ?v1)) (not (pred_11 ?v10 ?v4))))

(:action op_1
:parameters (?v4 ?v5)
:precondition (and (pred_5 ?v4) (pred_7 ?v5) 
                  (pred_4 ?v4) (pred_1 ?v5))
:effect (and (pred_3 ) (pred_11 ?v5 ?v4) (not (pred_1 ?v5)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_28 obj_06 obj_05 obj_20 obj_22 obj_15 obj_04 obj_18 obj_11 obj_13 obj_09 obj_24 obj_19 obj_17 obj_10 obj_08 obj_02 obj_29 obj_30 obj_21 obj_27 obj_03 obj_12 obj_26
    obj_07 obj_01
    obj_14 obj_25 obj_23
    )

    (:init
       (pred_3)

       (pred_5 obj_16)
       (pred_5 obj_28)
       (pred_5 obj_06)
       (pred_5 obj_05)
       (pred_5 obj_20)
       (pred_5 obj_22)
       (pred_5 obj_15)
       (pred_5 obj_04)
       (pred_5 obj_18)
       (pred_5 obj_11)
       (pred_5 obj_13)
       (pred_5 obj_09)
       (pred_5 obj_24)
       (pred_5 obj_19)
       (pred_5 obj_17)
       (pred_5 obj_10)
       (pred_5 obj_08)
       (pred_5 obj_02)
       (pred_5 obj_29)
       (pred_5 obj_30)
       (pred_5 obj_21)
       (pred_5 obj_27)
       (pred_5 obj_03)
       (pred_5 obj_12)
       (pred_5 obj_26)
       (pred_2 obj_07)
       (pred_2 obj_01)
       (pred_7 obj_14)
       (pred_7 obj_25)
       (pred_7 obj_23)

       (pred_8 obj_16 obj_22)
       (pred_8 obj_16 obj_28)
       (pred_8 obj_28 obj_15)
       (pred_8 obj_28 obj_06)
       (pred_8 obj_28 obj_16)
       (pred_8 obj_06 obj_04)
       (pred_8 obj_06 obj_05)
       (pred_8 obj_06 obj_28)
       (pred_8 obj_05 obj_18)
       (pred_8 obj_05 obj_20)
       (pred_8 obj_05 obj_06)
       (pred_8 obj_20 obj_11)
       (pred_8 obj_20 obj_05)
       (pred_8 obj_22 obj_13)
       (pred_8 obj_22 obj_15)
       (pred_8 obj_22 obj_16)
       (pred_8 obj_15 obj_09)
       (pred_8 obj_15 obj_04)
       (pred_8 obj_15 obj_28)
       (pred_8 obj_15 obj_22)
       (pred_8 obj_04 obj_24)
       (pred_8 obj_04 obj_18)
       (pred_8 obj_04 obj_06)
       (pred_8 obj_04 obj_15)
       (pred_8 obj_18 obj_19)
       (pred_8 obj_18 obj_11)
       (pred_8 obj_18 obj_05)
       (pred_8 obj_18 obj_04)
       (pred_8 obj_11 obj_17)
       (pred_8 obj_11 obj_20)
       (pred_8 obj_11 obj_18)
       (pred_8 obj_13 obj_10)
       (pred_8 obj_13 obj_09)
       (pred_8 obj_13 obj_22)
       (pred_8 obj_09 obj_08)
       (pred_8 obj_09 obj_24)
       (pred_8 obj_09 obj_15)
       (pred_8 obj_09 obj_13)
       (pred_8 obj_24 obj_02)
       (pred_8 obj_24 obj_19)
       (pred_8 obj_24 obj_04)
       (pred_8 obj_24 obj_09)
       (pred_8 obj_19 obj_29)
       (pred_8 obj_19 obj_17)
       (pred_8 obj_19 obj_18)
       (pred_8 obj_19 obj_24)
       (pred_8 obj_17 obj_30)
       (pred_8 obj_17 obj_11)
       (pred_8 obj_17 obj_19)
       (pred_8 obj_10 obj_21)
       (pred_8 obj_10 obj_08)
       (pred_8 obj_10 obj_13)
       (pred_8 obj_08 obj_27)
       (pred_8 obj_08 obj_02)
       (pred_8 obj_08 obj_09)
       (pred_8 obj_08 obj_10)
       (pred_8 obj_02 obj_03)
       (pred_8 obj_02 obj_29)
       (pred_8 obj_02 obj_24)
       (pred_8 obj_02 obj_08)
       (pred_8 obj_29 obj_12)
       (pred_8 obj_29 obj_30)
       (pred_8 obj_29 obj_19)
       (pred_8 obj_29 obj_02)
       (pred_8 obj_30 obj_26)
       (pred_8 obj_30 obj_17)
       (pred_8 obj_30 obj_29)
       (pred_8 obj_21 obj_27)
       (pred_8 obj_21 obj_10)
       (pred_8 obj_27 obj_03)
       (pred_8 obj_27 obj_08)
       (pred_8 obj_27 obj_21)
       (pred_8 obj_03 obj_12)
       (pred_8 obj_03 obj_02)
       (pred_8 obj_03 obj_27)
       (pred_8 obj_12 obj_26)
       (pred_8 obj_12 obj_29)
       (pred_8 obj_12 obj_03)
       (pred_8 obj_26 obj_30)
       (pred_8 obj_26 obj_12)
       (pred_6 obj_24)
       (pred_6 obj_29)
       (pred_6 obj_13)
       (pred_10  obj_24 obj_07)
       (pred_10  obj_29 obj_01)
       (pred_10  obj_13 obj_07)
       (pred_9 obj_16)
       (pred_9 obj_28)
       (pred_9 obj_06)
       (pred_9 obj_05)
       (pred_9 obj_20)
       (pred_9 obj_22)
       (pred_9 obj_15)
       (pred_9 obj_04)
       (pred_9 obj_18)
       (pred_9 obj_11)
       (pred_9 obj_09)
       (pred_9 obj_19)
       (pred_9 obj_17)
       (pred_9 obj_10)
       (pred_9 obj_08)
       (pred_9 obj_02)
       (pred_9 obj_30)
       (pred_9 obj_21)
       (pred_9 obj_27)
       (pred_9 obj_03)
       (pred_9 obj_12)
       (pred_9 obj_26)

       (pred_12  obj_14 obj_07)
       (pred_12  obj_25 obj_01)
       (pred_12  obj_23 obj_07)
       (pred_11 obj_14 obj_15)
       (pred_11 obj_25 obj_10)
       (pred_11 obj_23 obj_06)
       (pred_4 obj_03)
    )

    (:goal (and
       (pred_11 obj_23 obj_19)
    ))
(:constraints
  (always (not (pred_4 obj_02)))
)
)

; plan
1. (op_3 obj_03 obj_12)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_12)
   goals met: 0 of 1
2. (op_3 obj_12 obj_26)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_26)
   goals met: 0 of 1
3. (op_3 obj_26 obj_30)
   deleted: (pred_4 obj_26)
   added: (pred_4 obj_30)
   goals met: 0 of 1
4. (op_3 obj_30 obj_17)
   deleted: (pred_4 obj_30)
   added: (pred_4 obj_17)
   goals met: 0 of 1
5. (op_3 obj_17 obj_19)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_19)
   goals met: 0 of 1
6. (op_3 obj_19 obj_18)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_18)
   goals met: 0 of 1
7. (op_3 obj_18 obj_05)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_05)
   goals met: 0 of 1
8. (op_3 obj_05 obj_06)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_06)
   goals met: 0 of 1
9. (op_4 obj_06 obj_23)
   deleted: (pred_11 obj_23 obj_06) (pred_3)
   added: (pred_1 obj_23)
   goals met: 0 of 1
10. (op_3 obj_06 obj_05)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_05)
   goals met: 0 of 1
11. (op_3 obj_05 obj_18)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_18)
   goals met: 0 of 1
12. (op_3 obj_18 obj_19)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_19)
   goals met: 0 of 1
13. (op_1 obj_19 obj_23)
   deleted: (pred_1 obj_23)
   added: (pred_3) (pred_11 obj_23 obj_19)
   goals met: 1 of 1
